In [1]:
import pandas as pd

In [3]:
data1=pd.read_excel(r'C:\Users\maa\Desktop\My Data .xlsx')

In [4]:
data1

    Name  Age   Salary
0  Pinky    30   40000
1   John    22   15000
2   Neha    25   30000
3    Raj    26   35000

In [6]:
data2=pd.read_csv(r'C:\Users\maa\Desktop\My Data 1.csv')

In [9]:
data2

   Roll No    Name  Batch
0     1001   Pinky   1840
1     1002    John   1843
2     1003  Deepak   1840
3     1004    Anju   1765

In [13]:
data3=pd.read_csv(r'C:\Users\maa\Desktop\My Data 2.tsv',sep='\t')

In [14]:
data3

      Roll No.   Name  Batch
1001       NaN  Pinky   1840
1002       NaN   John   1765
1003       NaN   Neha   1345
1003       NaN    Raj   1540